In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
books= pd.read_csv("Books.csv")
users = pd.read_csv('users.csv')
ratings = pd.read_csv('ratings.csv')

C:\Users\MAYANK\AppData\Local\Temp\ipykernel_2308\3565690060.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  books= pd.read_csv("Books.csv")

In [5]:
books.shape

(271360, 8)

In [6]:
users.shape

(278858, 3)

In [7]:
ratings.shape

(1149780, 3)

In [8]:
books.sample()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
176891,0671435639,This Loving Land,Dorothy Garlock,1981,Pocket Books,http://images.amazon.com/images/P/0671435639.0...,http://images.amazon.com/images/P/0671435639.0...,http://images.amazon.com/images/P/0671435639.0...

In [9]:
ratings.sample()

        User-ID        ISBN  Book-Rating
668476   162639  0380807149            0

In [10]:
users.sample()

        User-ID                          Location   Age
239488   239489  malvern, england, united kingdom  25.0

In [11]:
books.drop(["Image-URL-S","Image-URL-M","Image-URL-L"], axis=1, inplace=True)

In [12]:
books.sample()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
4883,3453131169,FlÃ?Â¼stern in der Nacht.,Dean Koontz,1998,Heyne

In [13]:
new= books.merge(ratings, on="ISBN")

In [14]:
new.shape

(1031136, 7)

In [15]:
books.shape

(271360, 5)

In [16]:
ratings.shape

(1149780, 3)

In [17]:
new_df=new.merge(users, on="User-ID")

In [18]:
new_df.sample()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,User-ID,Book-Rating,Location,Age
500214,0312978367,The Prometheus Deception,Robert Ludlum,2001,St. Martin's Press,250925,9,"milton, ontario, canada",33.0

In [19]:
new_df.shape

(1031136, 9)

In [20]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1031136 entries, 0 to 1031135
Data columns (total 9 columns):
 #   Column               Non-Null Count    Dtype
---  ------               --------------    -----
 0   ISBN                 1031136 non-null  object
 1   Book-Title           1031136 non-null  object
 2   Book-Author          1031134 non-null  object
 3   Year-Of-Publication  1031136 non-null  object
 4   Publisher            1031134 non-null  object
 5   User-ID              1031136 non-null  int64
 6   Book-Rating          1031136 non-null  int64
 7   Location             1031136 non-null  object
 8   Age                  753301 non-null   float64
dtypes: float64(1), int64(2), object(6)
memory usage: 70.8+ MB

In [21]:
new_df.isnull().sum()

ISBN                        0
Book-Title                  0
Book-Author                 2
Year-Of-Publication         0
Publisher                   2
User-ID                     0
Book-Rating                 0
Location                    0
Age                    277835
dtype: int64

In [22]:
new_df=new_df.rename({"Book-Title":"title", "Book-Author":"author", "Year-Of-Publication":"year","User-ID":"ID","Book-Rating":"Rating"}, axis=1)

In [23]:
new_df.sample()

,ISBN,title,author,year,Publisher,ID,Rating,Location,Age
822274,1551666170,Lord Of The Desert (Mira),Diana Palmer,2000,Mira,165232,0,"saint albans, west virginia, usa",23.0

In [24]:
new_df.Rating.unique()

array([ 0,  5,  6,  7,  9,  8, 10,  3,  1,  4,  2], dtype=int64)

In [25]:
x=new_df.ID.value_counts()>200

In [26]:
y=x[x].index

In [27]:
y

Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352, 110973,
       235105,
       ...
       196047, 240567, 142093, 207782, 178199, 246311, 164323, 201783, 214272,
       269890],
      dtype='int64', name='ID', length=811)

In [28]:
new_df=new_df[new_df.ID.isin(y)]

In [29]:
new_df.shape

(474007, 9)

In [30]:
number_rating=new_df.groupby("title").count()["Rating"].reset_index()

In [31]:
number_rating.rename(columns={"Rating":"num_of_ratings"},inplace=True)

In [32]:
number_rating

                                                    title  num_of_ratings
0        A Light in the Storm: The Civil War Diary of ...               2
1                                   Always Have Popsicles               1
2                    Apple Magic (The Collector's series)               1
3        Beyond IBM: Leadership Marketing and Finance ...               1
4        Clifford Visita El Hospital (Clifford El Gran...               1
...                                                   ...             ...
155840                             Ã?Â?ber das Fernsehen.               2
155841  Ã?Â?ber die Pflicht zum Ungehorsam gegen den S...               3
155842                                      Ã?Â?lpiraten.               1
155843                              Ã?Â?stlich der Berge.               1
155844                                  Ã?Â?thique en toc               1

[155845 rows x 2 columns]

In [33]:
new_df.sample()

,ISBN,title,author,year,Publisher,ID,Rating,Location,Age
513909,0590483404,"A Shocker on Shock Street (Goosebumps, No 35)",R. L. Stine,1995,Scholastic,170742,0,"o`fallon, missouri, usa",41.0

In [34]:
final_df= new_df.merge(number_rating, on="title")

In [35]:
final_df.sample()

,ISBN,title,author,year,Publisher,ID,Rating,Location,Age,num_of_ratings
219612,044040830X,The Little Island (Dell Picture Yearling),Golden Macdonald,1993,Yearling Books,60244,0,"alvin, texas, usa",47.0,2

In [36]:
final_df.shape

(474007, 10)

In [37]:
final_df=final_df[final_df.num_of_ratings>=50]

In [38]:
final_df.shape

(58586, 10)

In [39]:
final_df.drop_duplicates(["ID", "title"], inplace=True)

In [40]:
final_df.shape

(56629, 10)

In [41]:
final_df.Age.isnull().sum()

12571

In [42]:
final_df.title= final_df.title.apply(lambda x: x.lower())

In [43]:
pt=final_df.pivot_table(columns="ID", index="title", values="Rating")

In [44]:
pt

ID,254,2276,2766,2977,3363,4017,4385,6251,6323,6543,...,271705,273979,274004,274061,274301,274308,275970,277427,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
1984,9.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,10.0,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN
1st to die: a novel,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2nd chance,NaN,10.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,0.0,NaN
4 blondes,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"\o\"" is for outlaw""",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,8.0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
wuthering heights,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN,NaN
year of wonders,NaN,NaN,NaN,7.0,NaN,NaN,NaN,NaN,NaN,0.0,...,NaN,9.0,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN
you belong to me,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
zen and the art of motorcycle maintenance: an inquiry into values,NaN,NaN,NaN,NaN,0.0,NaN,NaN,0.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.0,NaN,NaN,NaN
zoya,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [45]:
pt.fillna(0,inplace=True)

In [46]:
pt.sample()

ID,254,2276,2766,2977,3363,4017,4385,6251,6323,6543,...,271705,273979,274004,274061,274301,274308,275970,277427,277639,278418
title,,,,,,,,,,,,,,,,,,,,,
zen and the art of motorcycle maintenance: an inquiry into values,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

# MODEL 2

In [47]:
from sklearn.metrics.pairwise import cosine_similarity

In [48]:
similarity_score= cosine_similarity(pt)

In [49]:
similarity_score.shape

(704, 704)

In [50]:
def recommend(text):
    index=np.where(pt.index==text)[0][0]
#     distances= similarity_score(index)
    similar_items=sorted(list(enumerate(similarity_score[index])),key=lambda x:x[1] ,reverse=True)[1:6]
    
    for i in similar_items:
        print(pt.index[i[0]])

In [51]:
sorted(list(enumerate(similarity_score[0])),key=lambda x:x[1] ,reverse=True)[1:6]

[(544, 0.26737808296485693),
 (82, 0.2634114351153846),
 (47, 0.2472046934739493),
 (633, 0.23506027537093593),
 (343, 0.22751706211226183)]

In [52]:
list(enumerate(similarity_score[0]))[1:6] # however it was arranged

[(1, 0.08410009916576992),
 (2, 0.0),
 (3, 0.0),
 (4, 0.03566519642188754),
 (5, 0.03968172992304222)]

In [53]:
sorted(list(enumerate(similarity_score[0])),reverse=True)[1:6] #arranged backwards

[(702, 0.10186330086460314),
 (701, 0.0),
 (700, 0.057664239460121704),
 (699, 0.0),
 (698, 0.0)]

In [54]:
sorted(list(enumerate(similarity_score[0])),key=lambda x:x[1] ,reverse=True)[1:6] #arranged according to second index

[(544, 0.26737808296485693),
 (82, 0.2634114351153846),
 (47, 0.2472046934739493),
 (633, 0.23506027537093593),
 (343, 0.22751706211226183)]

In [55]:
recommend('animal farm')

1984
angus, thongs and full-frontal snogging: confessions of georgia nicolson
midnight
lord of the flies
brave new world

In [56]:
pt.index[545]

"the hitchhiker's guide to the galaxy"

In [57]:
import pickle

In [58]:
pickle.dump(pt, open("pt.pkl", "wb"))
pickle.dump(books,open("books.pkl",'wb'))
pickle.dump(similarity_score,open("similarity_scores", 'wb'))